# Pandas (Part 1)

Pandas is a Python library that includes a type of data structure called `dataframe` as well as associated code that helps manipulate and analyze data. Dataframes are very useful for storing and manipulating data in tabular form, with rows and columns. In this notebook, we will demonstrate various features for manipulating data in using pandas dataframes.

Let's start by importing the `pandas` library. We will also import `numpy`.

We will then create a dictionary containing some information and we will use pandas to convert it to a dataframe.

The first example is taken from: https://en.wikipedia.org/wiki/List_of_FIFA_World_Cup_top_goalscorers.

In [58]:
import pandas as pd

# Create a dictionary with information about some people - in this case the top 5 goal scorers at the FIFA World Cup
my_dict = { "Name": ["Miroslav Klose", "Ronaldo", "Gerd Muller", "Just Fontaine", "Lionel Messi"], 
            "Country": ["Germany", "Brazil", "West Germany", "France", "Argentina"], 
            "Goals": [16, 15, 14, 13, 13,], "Games":[24, 19, 13, 6, 26]}

# Convert the dictionary into a pandas dataframe object
df = pd.DataFrame(my_dict)

# Show first few rows of the data
df.head()

             Name       Country  Goals  Games
0  Miroslav Klose       Germany     16     24
1         Ronaldo        Brazil     15     19
2     Gerd Muller  West Germany     14     13
3   Just Fontaine        France     13      6
4    Lionel Messi     Argentina     13     26

## Dataframe Features

Now that we have the data stored in a dataframe, we can analyze the data and do some operations on the data.

The `shape` property returns the dimensions of the dataframe - basically the number of rows and number of columns. The `shape` property is a tuple whose first value is the number of rows and second value it number of columns.

The `describe()` method returns some **summary statistics** for the data.

In [59]:
# Get the shape of the data in the format (rows, cols)
df.shape

(5, 4)

In [61]:
# The describe method gives some summary stats
df.describe()

          Goals      Games
count   5.00000   5.000000
mean   14.20000  17.600000
std     1.30384   8.203658
min    13.00000   6.000000
25%    13.00000  13.000000
50%    14.00000  19.000000
75%    15.00000  24.000000
max    16.00000  26.000000

## Referencing Parts of the Dataframe

You can reference a row, a column or a particular value.

To get a whole column, just use the column name as an index: `df['Goals']` for example.

In [62]:
# Get the column 'Goals'
df['Goals']

0    16
1    15
2    14
3    13
4    13
Name: Goals, dtype: int64

You can reference a particular table value with the `iloc` method, giving the numerical value of the row and column. Think of `iloc` as being short for index or integer location.

The format is:
```
df.iloc(row_value, column_value)
```
Remember that indexing starts at 0 for both rows and columns.

In [63]:
# Print the entry in first row (row 0) and second column (column 1) of the data frame
print(df.iloc[0, 1])

Germany

In [64]:
# Print the entry in the second row and third column of the data frame
print(df.iloc[1, 2])

15

You can also use `iloc` to get a particular row.

In [65]:
# Print row 1 (second row) of the dataframe
print(df.iloc[1])

Name       Ronaldo
Country     Brazil
Goals           15
Games           19
Name: 1, dtype: object

You can use `iloc` to get a 'slice' of the dataframe.

In [66]:
# Print rows 2-3 and columns 1-2 from the dataframe
print(df.iloc[2:4, 1:3])

        Country  Goals
2  West Germany     14
3        France     13

# Modifying Data
We can add or remove rows and columns and modify the data in particular locations. We can also make changes based on conditions.

We will do the following with this example dataframe:

1. Change the title of the 'Games' column to 'Games Played'.
2. Change Ronaldo's name to "Ronaldo Luís Nazário de Lima".
3. Add a column called 'Goals per Game' to represent the scoring rate: goals / games played.
4. Add a column called '20+ Games' which will indicated whether the player played 20 or more games.
5. Drop the 'Games Played' column.

In [67]:
# Rename 'Games' column to 'Games Played'
# The 'inplace=True' argument changes the existing dataframe, rather than creating a copy
df.rename(columns={"Games":"Games Played"}, inplace=True)
df

             Name       Country  Goals  Games Played
0  Miroslav Klose       Germany     16            24
1         Ronaldo        Brazil     15            19
2     Gerd Muller  West Germany     14            13
3   Just Fontaine        France     13             6
4    Lionel Messi     Argentina     13            26

In [68]:
# Change Ronaldo's name to his full name (to avoid confusion with the other Ronaldo!)
# Note: You can also use df.loc[1, "Name"] here to reference the column by its label
df.iloc[1, 0] = "Ronaldo Luís Nazário de Lima"
df

                           Name       Country  Goals  Games Played
0                Miroslav Klose       Germany     16            24
1  Ronaldo Luís Nazário de Lima        Brazil     15            19
2                   Gerd Muller  West Germany     14            13
3                 Just Fontaine        France     13             6
4                  Lionel Messi     Argentina     13            26

In [69]:
# Create a new column called 'Over 40' with default value.
df['Goals per Game']=df['Goals'] / df["Games Played"]
df

,Name,Country,Goals,Games Played,Goals per Game
0,Miroslav Klose,Germany,16,24,0.666667
1,Ronaldo Luís Nazário de Lima,Brazil,15,19,0.789474
2,Gerd Muller,West Germany,14,13,1.076923
3,Just Fontaine,France,13,6,2.166667
4,Lionel Messi,Argentina,13,26,0.500000

In [53]:
# Create a column that indicates
df['20+ games'] = np.where(df['Games Played'] >= 20, 'Yes', 'No')
df

,Name,Country,Goals,Games Played,Goals per Game,20+ games
0,Miroslav Klose,Germany,16,24,0.666667,Yes
1,Ronaldo Luís Nazário de Lima,Brazil,15,19,0.789474,No
2,Gerd Muller,West Germany,14,13,1.076923,No
3,Just Fontaine,France,13,6,2.166667,No
4,Lionel Messi,Argentina,13,26,0.500000,Yes

In [54]:
# Drop the column 'Games Played'
# The 'inplace=True' argument changes the existing dataframe, rather than creating a copy
df.drop(columns=['Games Played'], inplace=True)
df

                           Name       Country  Goals  Goals per Game 20+ games
0                Miroslav Klose       Germany     16        0.666667       Yes
1  Ronaldo Luís Nazário de Lima        Brazil     15        0.789474        No
2                   Gerd Muller  West Germany     14        1.076923        No
3                 Just Fontaine        France     13        2.166667        No
4                  Lionel Messi     Argentina     13        0.500000       Yes

## Exercise 1

In this exercise, you will create a dataframe from a dictionary that lists the top ten fourteeners in Colorado and then carry out some standard operations.

Before doing task 1, run the code cell below to load the dictionary into a dataframe called `ft`.

In [57]:
# Here is the dictionary
ftns_dict = {'Rank': {0: '1', 1: '2', 2: '3', 3: '4', 4: '5', 5: '6', 6: '7', 7: '8', 8: '9', 9: '10'},
             'Summit Name': {0: 'Mount Elbert', 1: 'Mount Massive', 2: 'Mount Harvard', 3: 'Blanca Peak', 4: 'La Plata Peak', 5: 'Uncompahgre Peak', 6: 'Crestone Peak',
                             7: 'Mount Lincoln', 8: 'Grays Peak', 9: 'Castle Peak'},
             'Range': {0: 'Sawatch', 1: 'Sawatch', 2: 'Sawatch', 3: 'Sangre de Cristo', 4: 'Sawatch', 5: 'San Juan', 6: 'Sangre de Cristo', 7: 'Tenmile-Mosquito', 8: 'Front Range', 9: 'Elk'},
             'Elevation': {0: 14438, 1: 14427, 2: 14424, 3: 14350, 4: 14344, 5: 14318, 6: 14299, 7: 14293, 8: 14275, 9: 14274},
             'Prom.': {0: 9098, 1: 1983, 2: 2340, 3: 5335, 4: 1846, 5: 4249, 6: 4584, 7: 3860, 8: 2782, 9: 2358}}

# Add your code here to read the dictionary into a dataframe called 'ft'
ft = pd.DataFrame(ftns_dict)

 1. Use the `head()` method to see what the dataframe looks like.

In [70]:
# Type your code here

2. Use the `shape` property to see how many rows and columns there are.

In [71]:
# Type your code here

3. Rename the `'Elevation'` column `'Elevation (ft)'`.

In [72]:
 # Type your code here

4. Delete the `'Prom.'` column. Make sure you use inplace=True to store the result back in the ft dataframe.

In [73]:
 # Type your code here

5. Create a new column called `'Elevation (m)'` that gives the elevation of each mountain in metres. Use 1 ft = 0.3048 m.

In [74]:
 # Type your code here

6. Finally, use the `describe()` method to see a statistical summary of the data.

In [75]:
# Type your code here

## Good Job!

You've made it to the end of **Pandas (Part 1)**. 

If you have time, you can start looking at **Pandas (Part 2)**, which is in a separate notebook.